[
  {
    "id": 1,
    "name": "Francisco Delgado",
    "biography": "Francisco Delgado (Sutphin Boulevard-Archer Ave - E) is a proud Chamorro and member of the Tonawanda Band of Seneca (Wolf Clan). He works as an Assistant Professor of English at Borough of Manhattan Community College, where he teaches courses on writing, Native/Indigenous literatures, and Asian American literatures. \r\n\r\nHis creative work has recently appeared in Pithead Chapel, Lammergeier, and Glimmer Train. He is also the author of the chapbook, Adolescence, Secondhand (Honeysuckle Press). He lives in Forest Hills with his wife and their son."
  },
  {
    "id": 2,
    "name": "Amy Lemmon",
    "biography": "Amy Lemmon (“Evening Call,” 36th Avenue - N) is the author of five poetry collections, including Saint Nobody (Red Hen Press) and The Miracles (C&R Press). \r\n\r\nHer poems and essays have appeared in The Best American Poetry, Rolling Stone, New Letters, Prairie Schooner, Verse, Court Green, The Journal, Marginalia, and many other magazines and anthologies. Amy is Professor of English at the Fashion Institute of Technology-SUNY, where she teaches writing, literature, and creativity. \r\n\r\nShe is the proud solo parent of two young adults, one of whom is intellectually disabled and in residential care. Born and raised in Ohio, she has lived in Astoria, Queens, since 1996."
  },
  {
    "id": 3,
    "name": "Kimiko Hahn",
    "biography": "Kimiko Hahn (Forest Hills - F) is the author of ten books of poems, including Foreign Bodies (W.W. Norton, 2020), an exploration of how objects take over current events, one’s life, and even one’s body. Hahn is a distinguished professor in the MFA Program in Creative Writing & Literary Translation at Queens College, City University of New York."
  },
  {
    "id": 4,
    "name": "Maria Terrone",
    "biography": "Maria Terrone (Jackson Heights/Roosevelt Avenue - 7) is the author of the poetry collections Eye to Eye (Bordighera Press, 2014); A Secret Room in Fall (McGovern Prize, Ashland Poetry Press).\r\n\r\nHer work, which has been published in French and Farsi and nominated four times for a Pushcart Prize, has appeared in media including POETRY, Ploughshares, Poetry Daily, The Hudson Review, and in more than 25 anthologies. (INCREASE BIO CHARACTER LIMIT)"
  },
  {
    "id": 5,
    "name": "Rosebud Ben-Oni",
    "biography": "Rosebud Ben-Oni (Vernon Boulevard - 7) is the winner of the 2019 Alice James Award for If This Is the Age We End Discovery, forthcoming in 2021, and the author of turn around, BRXGHT XYXS (Get Fresh Books, 2019). \r\n\r\nhe is a recipient of fellowships from the New York Foundation for the Arts (NYFA) and CantoMundo. Her work appears in POETRY, The American Poetry Review, POETS.org, and more (INCREASE BIO CHARACTER LIMIT)"
  },
  {
    "id": 6,
    "name": "KC Trommer",
    "biography": "KC Trommer (Hunters Point - 7) is the author of the debut poetry collection We Call Them Beautiful (Diode Editions, 2019) and the chapbook The Hasp Tongue (dancing girl press, 2014). \r\n\r\n Founder of the collaborative audio project QUEENSBOUND, she is the Assistant Director of Communications at NYU Gallatin. She lives in Jackson Heights, Queens, with her son."
  },
  {
    "id": 7,
    "name": "Safia Jama",
    "biography": "Safia Jama (33rd Street - 7) was born to a Somali father and an Irish-American mother in Queens, New York. A Harvard graduate and a Cave Canem fellow, she has published poetry in Reverie, Boston Review, BOMB, Cagibi, Under a Warm Green Linden and No, Dear.  \r\n\r\n Safia was a semi-finalist in the Washington Prize and the Pleiades Press Editors Prize for Poetry. Recently, CUNY TV invited her to talk about her life, poetry and multiracial background for a segment of the “Shades of U.S.” series."
  },
  {
    "id": 8,
    "name": "Paolo Javier",
    "biography": "Paolo Javier (40th St - 7) is a featured artist in Queens International 2018: Volumes. He’s produced three albums of sound poetry with Listening Center (David Mason), including the limited edition pamphlet/cassette Ur’lyeh/ Aklopolis (Texte und Töne, 2016), and Maybe the Sweet Honey Pours (Temporary Tapes 2018), whose poems will be published by NION Editions in 2019.  \r\n\r\nThe author of four full-length poetry collections, he recently completed OBB aka The Original Brown Boy (Nightboat Books 2020), a {weird postcolonial techno dreampop} comics poem he began writing and developing in 2005, with illustrations by Alex Tarampi and Ernest Concepcion."
  }
]
