[
  {
    "id": 1,
    "name": "Francisco Delgado",
    "biography": "Francisco Delgado (Sutphin Boulevard-Archer Ave - E) is a proud Chamorro and member of the Tonawanda Band of Seneca (Wolf Clan). He works as an Assistant Professor of English at Borough of Manhattan Community College, where he teaches courses on writing, Native/Indigenous literatures, and Asian American literatures. \r\n\r\nHis creative work has recently appeared in Pithead Chapel, Lammergeier, and Glimmer Train. He is also the author of the chapbook, Adolescence, Secondhand (Honeysuckle Press). He lives in Forest Hills with his wife and their son."
  },
  {
    "id": 2,
    "name": "Amy Lemmon",
    "biography": "Amy Lemmon (“Evening Call,” 36th Avenue - N) is the author of five poetry collections, including Saint Nobody (Red Hen Press) and The Miracles (C&R Press). \r\n\r\nHer poems and essays have appeared in The Best American Poetry, Rolling Stone, New Letters, Prairie Schooner, Verse, Court Green, The Journal, Marginalia, and many other magazines and anthologies. Amy is Professor of English at the Fashion Institute of Technology-SUNY, where she teaches writing, literature, and creativity. \r\n\r\nShe is the proud solo parent of two young adults, one of whom is intellectually disabled and in residential care. Born and raised in Ohio, she has lived in Astoria, Queens, since 1996."
  },
  {
    "id": 3,
    "name": "Kimiko Hahn",
    "biography": "Kimiko Hahn (Forest Hills - F) is the author of ten books of poems, including Foreign Bodies (W.W. Norton, 2020), an exploration of how objects take over current events, one’s life, and even one’s body. Hahn is a distinguished professor in the MFA Program in Creative Writing & Literary Translation at Queens College, City University of New York."
  },
  {
    "id": 4,
    "name": "Maria Terrone",
    "biography": "Maria Terrone (Jackson Heights/Roosevelt Avenue - 7) is the author of the poetry collections Eye to Eye (Bordighera Press, 2014); A Secret Room in Fall (McGovern Prize, Ashland Poetry Press).\r\n\r\nHer work, which has been published in French and Farsi and nominated four times for a Pushcart Prize, has appeared in media including POETRY, Ploughshares, Poetry Daily, The Hudson Review, and in more than 25 anthologies. (INCREASE BIO CHARACTER LIMIT)"
  },
  {
    "id": 5,
    "name": "Rosebud Ben-Oni",
    "biography": "Rosebud Ben-Oni (Vernon Boulevard - 7) is the winner of the 2019 Alice James Award for If This Is the Age We End Discovery, forthcoming in 2021, and the author of turn around, BRXGHT XYXS (Get Fresh Books, 2019). \r\n\r\nhe is a recipient of fellowships from the New York Foundation for the Arts (NYFA) and CantoMundo. Her work appears in POETRY, The American Poetry Review, POETS.org, and more (INCREASE BIO CHARACTER LIMIT)"
  },
  {
    "id": 6,
    "name": "KC Trommer",
    "biography": "KC Trommer (Hunters Point - 7) is the author of the debut poetry collection We Call Them Beautiful (Diode Editions, 2019) and the chapbook The Hasp Tongue (dancing girl press, 2014). \r\n\r\n Founder of the collaborative audio project QUEENSBOUND, she is the Assistant Director of Communications at NYU Gallatin. She lives in Jackson Heights, Queens, with her son."
  },
  {
    "id": 7,
    "name": "Safia Jama",
    "biography": "Safia Jama (33rd Street - 7) was born to a Somali father and an Irish-American mother in Queens, New York. A Harvard graduate and a Cave Canem fellow, she has published poetry in Reverie, Boston Review, BOMB, Cagibi, Under a Warm Green Linden and No, Dear.  \r\n\r\n Safia was a semi-finalist in the Washington Prize and the Pleiades Press Editors Prize for Poetry. Recently, CUNY TV invited her to talk about her life, poetry and multiracial background for a segment of the “Shades of U.S.” series."
  },
  {
    "id": 8,
    "name": "Paolo Javier",
    "biography": "Paolo Javier (40th St - 7) is a featured artist in Queens International 2018: Volumes. He’s produced three albums of sound poetry with Listening Center (David Mason), including the limited edition pamphlet/cassette Ur’lyeh/ Aklopolis (Texte und Töne, 2016), and Maybe the Sweet Honey Pours (Temporary Tapes 2018), whose poems will be published by NION Editions in 2019.  \r\n\r\nThe author of four full-length poetry collections, he recently completed OBB aka The Original Brown Boy (Nightboat Books 2020), a {weird postcolonial techno dreampop} comics poem he began writing and developing in 2005, with illustrations by Alex Tarampi and Ernest Concepcion."
  },
  {
    "id": 9,
    "name": "Nicole Haroutunian",
    "biography": "Nicole Hartounian (52nd St - 7) is the author of the short story collection Speed Dreaming (Little A, 2015) and literary co-editor of the anthology Silent Beaches, Untold Stories: New York City’s Forgotten Waterfront (Damiani, 2016).  \r\n\r\n Her work has appeared in Post Road, Joyland, Vol. 1 Brooklyn, Day One, Tin House’s Open Bar, and elsewhere. She is an editor of the digital arts platform Underwater New York and cofounder of the reading series Halfway There. She has an MFA from Sarah Lawrence College and lives in Woodside, Queens."
  },
  {
    "id": 10,
    "name": "Jimena Lucero",
    "biography": "Jimena Lucero (“Then, Here, & Will Be”) is a poet, actor, and a sister. She was a 2019-2020 Emerge-Surface-Be fellow at the Poetry Project.\r\n\r\nHer writing appears in The Recluse, Nightboat’s Echo, EOAGH, Colorbloq.org, and more. She recently made a short film titled Silver Femme. It screened at the Ann Arbor Film festival. Jimena’s work is rooted in trans liberation, disability justice, and future building."
  },
  {
    "id": 11,
    "name": "Jackie Sherbow",
    "biography": "CJackie Sherbow (69th Street - 7) is the author of Harbinger, a chapbook from Finishing Line Press. Her poems have appeared or are forthcoming in places like Asimov’s Science Fiction, Sierra Nevada Review, Coffin Bell, Luna Luna, and Day One, and have been part of the Emotive Fruition performance series. \r\n\r\n She works as the managing editor of Alfred Hitchcock's Mystery Magazine and Ellery Queen's Mystery Magazine as well as the editor of Newtown Literary—the literary journal dedicated to the borough of Queens—and was a participant in the 2018 Queens Council on the Arts Artists Peer Circle. Her work was nominated for the 2019 Best of the Net Anthology. She lives in Woodside."
  },
  {
    "id": 12,
    "name": "Vikas K. Menon",
    "biography": "Vikas K. Menon (82nd St - 7) is a poet, playwright, and songwriter. He was a 2015 Emerging Poets Fellow at Poets House and his poems have been featured in numerous publications, including Indivisible: An Anthology of South Asian American Poetry and The HarperCollins Book of English Poetry. He co-wrote Priya’s Shakti (www.priyashakti.com), the first of a series of ongoing augmented reality comic books that address gender-based violence (GBV)."
  },
  {
    "id": 13,
    "name": "Abeer Y. Hoque",
    "biography": "Abeer Hoque (90th St - 7) is a Nigerian-born Bangladeshi American writer and photographer. She is the author of a coffee table book of travel photographs and poems, The Long Way Home, the linked story collection, The Lovers and the Leavers, and a memoir, Olive Witch."
  },
  {
    "id": 14,
    "name": "Nadia Q. Ahmad",
    "biography": "Nadia Q. Ahmad (Junction Blvd - Express - 7) is a poet, writer, and editor based in Queens. Her work has been published in The Shoreline Review, Poets & Writers Magazine, Newtown Literary, SpliceLit, AAWW Open City, and The Margins."
  },
  {
    "id": 15,
    "name": "Bushra Rehman",
    "biography": "Bushra Rehman (103rd Street /Corona Plaza - 7) is a writer and cultural activist. Her novel Corona, a dark comedy about being Pakistani-American, was noted by Poets & Writers among the year’s Best Debut Fiction and her co-edited anthology Colonize This! Young Women of Color on Today’s Feminism was chosen as one of Ms. Magazine's '100 Best Non-fiction Books of All Time.'"
  },
  {
    "id": 16,
    "name": "Adam DeGraff and Tyler Burba",
    "biography": "Poet Adam DeGraff took the texts of 2018 poems and created a cento of it, set it to music, and performed it with Tyler Burba at The Queens Musuem at the reception reception in the Panorama of the City of New York in 2018. This audio was recorded at Q.E.D. Astoria in 2018."
  },
  {
    "id": 17,
    "name": "Joe Gross",
    "biography": "Joe Gross (“Beatitude,” Flushing-Main Street - 7) is a bookseller, poet, translator, and author of the prize-winning chapbook Lest We All Get Clipped (Ghostbird Press, 2023). His work has been anthologized in Eating Alone: Essays & Reflections (Clotheslines Press, 2023) and the pearl (Wyeth Renwick, 2023) and has appeared in KtB Magazine"
  },
  {
    "id": 18,
    "name": "Additional Artist",
    "biography": "This is a placeholder for an additional artist bio to match the recent edits in the other files."
  }
]
